# PANDAS

In [1]:
import numpy as np
import pandas as pd

In [2]:
Ser=pd.Series([0,1,2,3,4,5,6,7,8,9,10])

In [3]:
Ser

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
dtype: int64

In [4]:
Ser=pd.Series([20,10.5,'50'])

In [5]:
Ser

0      20
1    10.5
2      50
dtype: object

In [6]:
dict={'A':[1,2,3],'B':[4,5,6,],'C':[7,8,9]}

In [7]:
dict

{'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]}

In [8]:
dict={'A':[1,2,3],'B':[4,5,6,],'C':[7,8,9]}
df=pd.DataFrame(dict)

In [9]:
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [10]:
#add new coloumn and add values in to it
df['D']=[11,12,13]

In [11]:
df

   A  B  C   D
0  1  4  7  11
1  2  5  8  12
2  3  6  9  13

In [12]:
df['Gender']=['female','male','male']

In [13]:
df

   A  B  C   D  Gender
0  1  4  7  11  female
1  2  5  8  12    male
2  3  6  9  13    male

In [14]:
#How to create NaN values and its manipulation
dict={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[6,7,8]}

In [15]:
df=pd.DataFrame(dict)

In [16]:
df

     A    B  C
0  1.0  5.0  6
1  2.0  NaN  7
2  NaN  NaN  8

In [17]:
df['D']=[9,10,11]

In [18]:
df

     A    B  C   D
0  1.0  5.0  6   9
1  2.0  NaN  7  10
2  NaN  NaN  8  11

# DROPPING

In [19]:
print("\nDropping any coloumn with a NaN values\n",'-'*50,sep='')
print(df.dropna(axis=1))

Dropping any coloumn with a NaN values
--------------------------------------------------
   C   D
0  6   9
1  7  10
2  8  11

In [20]:
df['NAME']=['raju','rani',np.nan]

In [21]:
df

     A    B  C   D  NAME
0  1.0  5.0  6   9  raju
1  2.0  NaN  7  10  rani
2  NaN  NaN  8  11   NaN

In [22]:
print(df.dropna(axis=1))

   C   D
0  6   9
1  7  10
2  8  11

In [23]:
print(df.dropna(axis=0))

     A    B  C  D  NAME
0  1.0  5.0  6  9  raju

In [24]:
df

     A    B  C   D  NAME
0  1.0  5.0  6   9  raju
1  2.0  NaN  7  10  rani
2  NaN  NaN  8  11   NaN

# FILLING VALUES

In [25]:
df

     A    B  C   D  NAME
0  1.0  5.0  6   9  raju
1  2.0  NaN  7  10  rani
2  NaN  NaN  8  11   NaN

In [26]:
print("\n filling a value with a default values\n",'-'*50,sep='')
print(df.fillna(value=50))

 filling a value with a default values
--------------------------------------------------
      A     B  C   D  NAME
0   1.0   5.0  6   9  raju
1   2.0  50.0  7  10  rani
2  50.0  50.0  8  11    50

In [27]:
print(df.fillna(value=df['A'].mean(),inplace=True))

None

In [28]:
df

     A    B  C   D  NAME
0  1.0  5.0  6   9  raju
1  2.0  1.5  7  10  rani
2  1.5  1.5  8  11   1.5

In [29]:
#CREATE DATAFRAME
data={'company':['google','google','mest','mest','fb','fb'],'person':['Raja','Rani','Ramu','Ramesh','Rakhi','Rukku'],'SALES':[200,400,600,800,1000,1200]}
df=pd.DataFrame(data)

In [30]:
df

  company  person  SALES
0  google    Raja    200
1  google    Rani    400
2    mest    Ramu    600
3    mest  Ramesh    800
4      fb   Rakhi   1000
5      fb   Rukku   1200

In [31]:
list=df.groupby('company')
print("\n Grouping by 'company' column and listing mean sales\n",'-'*50,sep='')
print(list.mean())

 Grouping by 'company' column and listing mean sales
--------------------------------------------------
          SALES
company
fb       1100.0
google    300.0
mest      700.0

In [32]:
list=df.groupby('company')
print(list.sum())

         SALES
company
fb        2200
google     600
mest      1400

# concating dataframe

In [33]:
import pandas as pd

In [34]:
class_a=pd.DataFrame({'math':[25,35,45,55],
                      'Eng':[52,62,42,62],
                      'sci':[63,43,53,61],
                      'chem':[82,92,72,92]},
                      index=['RAJU','RANI','SHYAMALA','NANDHINI'])

In [35]:
class_a

          math  Eng  sci  chem
RAJU        25   52   63    82
RANI        35   62   43    92
SHYAMALA    45   42   53    72
NANDHINI    55   62   61    92

In [36]:
class_b=pd.DataFrame({"math":[62,52,42,72],
                      "Eng":[51,61,41,71],
                      "sci":[62,85,75,95],
                      "chem":[85,75,95,62]},
                      index=['BALU','NEELU','RAJESH','BHARATH'])

In [37]:
class_b

         math  Eng  sci  chem
BALU       62   51   62    85
NEELU      52   61   85    75
RAJESH     42   41   75    95
BHARATH    72   71   95    62

In [38]:
class_c=pd.DataFrame({'math':[62,52,42,72],
                      'Eng':[51,61,41,71],
                      'sci':[62,85,75,95],
                      'chem':[85,75,95,62]},
                      index=['MALLI','RAKHI','RINKY','SHAMA'])

In [39]:
class_c

       math  Eng  sci  chem
MALLI    62   51   62    85
RAKHI    52   61   85    75
RINKY    42   41   75    95
SHAMA    72   71   95    62

In [40]:
all_students_marks=pd.concat([class_a,class_b,class_c],axis=0)
print("\n after concatation along row \n",'='*50,sep='')
print(all_students_marks)

 after concatation along row
==================================================
          math  Eng  sci  chem
RAJU        25   52   63    82
RANI        35   62   43    92
SHYAMALA    45   42   53    72
NANDHINI    55   62   61    92
BALU        62   51   62    85
NEELU       52   61   85    75
RAJESH      42   41   75    95
BHARATH     72   71   95    62
MALLI       62   51   62    85
RAKHI       52   61   85    75
RINKY       42   41   75    95
SHAMA       72   71   95    62

In [41]:
all_students=pd.concat([class_a,class_b,class_c],axis=1)
print(all_students)

          math   Eng   sci  chem  math   Eng   sci  chem  math   Eng   sci  \
RAJU      25.0  52.0  63.0  82.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN
RANI      35.0  62.0  43.0  92.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN
SHYAMALA  45.0  42.0  53.0  72.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN
NANDHINI  55.0  62.0  61.0  92.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN
BALU       NaN   NaN   NaN   NaN  62.0  51.0  62.0  85.0   NaN   NaN   NaN
NEELU      NaN   NaN   NaN   NaN  52.0  61.0  85.0  75.0   NaN   NaN   NaN
RAJESH     NaN   NaN   NaN   NaN  42.0  41.0  75.0  95.0   NaN   NaN   NaN
BHARATH    NaN   NaN   NaN   NaN  72.0  71.0  95.0  62.0   NaN   NaN   NaN
MALLI      NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  62.0  51.0  62.0
RAKHI      NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  52.0  61.0  85.0
RINKY      NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  42.0  41.0  75.0
SHAMA      NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  72.0  71.0  95.0

          chem
RAJU       NaN
RANI       NaN
SHYAMALA   NaN
NANDHINI   NaN
BALU       NaN
NEELU      NaN
RAJESH     NaN
BHARATH    NaN
MALLI     85.0
RAKHI     75.0
RINKY     95.0
SHAMA     62.0

In [42]:
all_students.fillna(value=0,inplace=True)

In [43]:
(all_students)

,math,Eng,sci,chem,math,Eng,sci,chem,math,Eng,sci,chem
RAJU,25.0,52.0,63.0,82.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
RANI,35.0,62.0,43.0,92.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
SHYAMALA,45.0,42.0,53.0,72.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
NANDHINI,55.0,62.0,61.0,92.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
BALU,0.0,0.0,0.0,0.0,62.0,51.0,62.0,85.0,0.0,0.0,0.0,0.0
NEELU,0.0,0.0,0.0,0.0,52.0,61.0,85.0,75.0,0.0,0.0,0.0,0.0
RAJESH,0.0,0.0,0.0,0.0,42.0,41.0,75.0,95.0,0.0,0.0,0.0,0.0
BHARATH,0.0,0.0,0.0,0.0,72.0,71.0,95.0,62.0,0.0,0.0,0.0,0.0
MALLI,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,62.0,51.0,62.0,85.0
RAKHI,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,52.0,61.0,85.0,75.0
RINKY,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,42.0,41.0,75.0,95.0
SHAMA,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,72.0,71.0,95.0,62.0

In [44]:
list= pd.DataFrame({"mat":[45,54,65,75],
                    "eng":[35,53,62,45],
                    "sci":[85,95,75,62]},
                    index=['raji','raju','rani','raja'])

In [45]:
(list)

      mat  eng  sci
raji   45   35   85
raju   54   53   95
rani   65   62   75
raja   75   45   62

In [46]:
list1=pd.DataFrame({"mat":[45,54,65,75],
                    "eng":[35,53,62,45],
                    "sci":[85,95,75,62]},
                    index=['shannu','deepa','akhil','monal'])

In [47]:
(list1)

        mat  eng  sci
shannu   45   35   85
deepa    54   53   95
akhil    65   62   75
monal    75   45   62

In [48]:
list2=pd.DataFrame({"mat":[45,54,65,75],
                    "eng":[35,53,62,45],
                    "sci":[85,95,75,62]},
                   index=['nanni','deva','lavanya','gazzar'])

In [49]:
(list2)

         mat  eng  sci
nanni     45   35   85
deva      54   53   95
lavanya   65   62   75
gazzar    75   45   62

In [50]:

print("\n after concating column \n",'-'*50,sep='')
result=pd.concat([list,list1,list2],axis=1)
print(result)

 after concating column
--------------------------------------------------
          mat   eng   sci   mat   eng   sci   mat   eng   sci
raji     45.0  35.0  85.0   NaN   NaN   NaN   NaN   NaN   NaN
raju     54.0  53.0  95.0   NaN   NaN   NaN   NaN   NaN   NaN
rani     65.0  62.0  75.0   NaN   NaN   NaN   NaN   NaN   NaN
raja     75.0  45.0  62.0   NaN   NaN   NaN   NaN   NaN   NaN
shannu    NaN   NaN   NaN  45.0  35.0  85.0   NaN   NaN   NaN
deepa     NaN   NaN   NaN  54.0  53.0  95.0   NaN   NaN   NaN
akhil     NaN   NaN   NaN  65.0  62.0  75.0   NaN   NaN   NaN
monal     NaN   NaN   NaN  75.0  45.0  62.0   NaN   NaN   NaN
nanni     NaN   NaN   NaN   NaN   NaN   NaN  45.0  35.0  85.0
deva      NaN   NaN   NaN   NaN   NaN   NaN  54.0  53.0  95.0
lavanya   NaN   NaN   NaN   NaN   NaN   NaN  65.0  62.0  75.0
gazzar    NaN   NaN   NaN   NaN   NaN   NaN  75.0  45.0  62.0

In [51]:
result.fillna(value=0 ,inplace=True)

In [52]:
result

          mat   eng   sci   mat   eng   sci   mat   eng   sci
raji     45.0  35.0  85.0   0.0   0.0   0.0   0.0   0.0   0.0
raju     54.0  53.0  95.0   0.0   0.0   0.0   0.0   0.0   0.0
rani     65.0  62.0  75.0   0.0   0.0   0.0   0.0   0.0   0.0
raja     75.0  45.0  62.0   0.0   0.0   0.0   0.0   0.0   0.0
shannu    0.0   0.0   0.0  45.0  35.0  85.0   0.0   0.0   0.0
deepa     0.0   0.0   0.0  54.0  53.0  95.0   0.0   0.0   0.0
akhil     0.0   0.0   0.0  65.0  62.0  75.0   0.0   0.0   0.0
monal     0.0   0.0   0.0  75.0  45.0  62.0   0.0   0.0   0.0
nanni     0.0   0.0   0.0   0.0   0.0   0.0  45.0  35.0  85.0
deva      0.0   0.0   0.0   0.0   0.0   0.0  54.0  53.0  95.0
lavanya   0.0   0.0   0.0   0.0   0.0   0.0  65.0  62.0  75.0
gazzar    0.0   0.0   0.0   0.0   0.0   0.0  75.0  45.0  62.0

# merge

In [53]:
player_id_name=pd.DataFrame({'ID':[25,63,42,52],
                             'NAME':['harika','jessi','janu','jhansi']})

In [54]:
print("\n player_id_name \n",'='*30,sep='')
player_id_name

 player_id_name
==============================

   ID    NAME
0  25  harika
1  63   jessi
2  42    janu
3  52  jhansi

In [55]:
player_details=pd.DataFrame({'ID':[25,63,42,52,64,24],
                             'AGE':[65,52,41,63,42,32],
                             'country':['MANOPAD','CHENNIPAD','POTHULAPAD','AMRAVAI','NANDHAYALA','CHOWRASTA']})

In [56]:
player_details

   ID  AGE     country
0  25   65     MANOPAD
1  63   52   CHENNIPAD
2  42   41  POTHULAPAD
3  52   63     AMRAVAI
4  64   42  NANDHAYALA
5  24   32   CHOWRASTA

In [57]:
pd.merge(player_id_name,player_details,on='ID')

   ID    NAME  AGE     country
0  25  harika   65     MANOPAD
1  63   jessi   52   CHENNIPAD
2  42    janu   41  POTHULAPAD
3  52  jhansi   63     AMRAVAI

# JOIN

In [58]:
left=pd.DataFrame({'A':['A0','A1','A2'],
                  'B':['B0','B1','B2']},
                  index=['k0','k1','k2'])

In [59]:
left

     A   B
k0  A0  B0
k1  A1  B1
k2  A2  B2

In [60]:
right=pd.DataFrame({'C':['C0','C2','C3'],
                   'D':['D0','D2','D3']},
                   index=['k0','k2','k3'])

In [61]:
right

     C   D
k0  C0  D0
k2  C2  D2
k3  C3  D3

In [62]:
left.join(right)

     A   B    C    D
k0  A0  B0   C0   D0
k1  A1  B1  NaN  NaN
k2  A2  B2   C2   D2

In [63]:
right.join(left,how='outer')

      C    D    A    B
k0   C0   D0   A0   B0
k1  NaN  NaN   A1   B1
k2   C2   D2   A2   B2
k3   C3   D3  NaN  NaN

# APPLY FUNCTION

In [64]:
import pandas as pd

In [65]:
df = pd.DataFrame({'Dept':[1,2,3,4,5,6],
              'EMP_NAME':['RAJESH','RANI','RAGHU','RAMUDU','RAYUDU','RAMANI'],
              'Salary':[4944,5455,6144,4044,3433,2922]})

In [66]:
df

   Dept EMP_NAME  Salary
0     1   RAJESH    4944
1     2     RANI    5455
2     3    RAGHU    6144
3     4   RAMUDU    4044
4     5   RAYUDU    3433
5     6   RAMANI    2922

In [67]:
def salary_hike(x):
    if(x>3000):
        return np.ceil(x+(x*.30))
    else:
        return np.ceil(x+1.5)

In [68]:
print(salary_hike)

<function salary_hike at 0x000001F4D39B9160>

In [69]:
df['New_Salary'] = df['Salary'].apply(salary_hike)

In [70]:
df

   Dept EMP_NAME  Salary  New_Salary
0     1   RAJESH    4944      6428.0
1     2     RANI    5455      7092.0
2     3    RAGHU    6144      7988.0
3     4   RAMUDU    4044      5258.0
4     5   RAYUDU    3433      4463.0
5     6   RAMANI    2922      2924.0

In [71]:
df['New_Length']=df['EMP_NAME'].apply(len)

In [72]:
df

   Dept EMP_NAME  Salary  New_Salary  New_Length
0     1   RAJESH    4944      6428.0           6
1     2     RANI    5455      7092.0           4
2     3    RAGHU    6144      7988.0           5
3     4   RAMUDU    4044      5258.0           6
4     5   RAYUDU    3433      4463.0           6
5     6   RAMANI    2922      2924.0           6

In [73]:
df['New_Salary'].apply(lambda x:np.sqrt(x))

0    80.174809
1    84.214013
2    89.375612
3    72.512068
4    66.805688
5    54.074023
Name: New_Salary, dtype: float64

In [74]:
print("\n sum of the coloumn 'NEW_SALARY'is:\n",'-'*30,sep='')
df['New_Salary'].sum()

 sum of the coloumn 'NEW_SALARY'is:
------------------------------

34153.0

In [75]:
print("min and max of the coloumn 'NEW_SALARY' are:")
df['New_Salary'].min()

min and max of the coloumn 'NEW_SALARY' are:

2924.0

In [76]:
df['New_Salary'].max()

7988.0

In [77]:
print("\n NAME OF THE COLUMNS \n",'-'*30,sep='')
print(df.columns)

 NAME OF THE COLUMNS
------------------------------
Index(['Dept', 'EMP_NAME', 'Salary', 'New_Salary', 'New_Length'], dtype='object')

In [78]:
df

   Dept EMP_NAME  Salary  New_Salary  New_Length
0     1   RAJESH    4944      6428.0           6
1     2     RANI    5455      7092.0           4
2     3    RAGHU    6144      7988.0           5
3     4   RAMUDU    4044      5258.0           6
4     5   RAYUDU    3433      4463.0           6
5     6   RAMANI    2922      2924.0           6

In [79]:
print(df.columns)

Index(['Dept', 'EMP_NAME', 'Salary', 'New_Salary', 'New_Length'], dtype='object')

In [80]:
del

SyntaxError: invalid syntax (Temp/ipykernel_10468/3545070469.py, line 1)

# FINDING NULL VALUE

In [ ]:
df=pd.DataFrame({'NAME':['nani','rani',np.nan,np.nan],
                'GENDER':[np.nan,'m','f','m'],
                'SECTION':['a','b','c','d'],
                'class':[np.nan,np.nan,5,12],
                'phone number':['bengloor','chennai','hydarabad','np.nan'],
                'sate':['up','telangana',np.nan,np.nan]})

In [ ]:
df

In [ ]:
df.isnull().sum()

# Load.CSV file

In [ ]:
import pandas as pd

In [ ]:
ipl=pd.read_csv("https://raw.githubusercontent.com/training-ml/Files/main/matches.csv")

In [ ]:
ipl.head()

In [ ]:
data = pd.read_csv('dummyfile.csv')

In [ ]:
data

In [ ]:
ipl=pd.read_csv("https://raw.githubusercontent.com/shebarajitha/Files/main/matches.csv")

In [ ]:
ipl

In [ ]:
ipl.tail()

In [ ]:
data=pd.read_csv("https://raw.githubusercontent.com/shebarajitha/Files/main/matches.csv")

In [ ]:
data

In [ ]:
data.tail()

In [ ]:
data.head()

In [ ]:
data.shape

# IMPORTING DATA FROM OTHER FOLDER IN YOUR SYSTEM

In [ ]:
data=pd.read_csv(r"https://raw.githubusercontent.com/training-ml/Files/main/matches.csv")

In [ ]:
data

In [ ]:
data=pd.read_csv("https://raw.githubusercontent.com/shebarajitha/Files/main/titanic_train.csv")

In [ ]:
data

In [ ]:
data.sample(n=5)

In [ ]:
data.shape

# Read excel file

In [95]:
Excel_file=pd.read_excel(r'C:\\Users\\sheba\\Downloads\\Data_Train (2).xlsx')

In [92]:
Excel_file

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU IXR BBI BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL LKO BOM COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU NAG BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR NAG DEL,16:50,21:35,4h 45m,1 stop,No info,13302
...,...,...,...,...,...,...,...,...,...,...,...
10678,Air Asia,9/04/2019,Kolkata,Banglore,CCU BLR,19:55,22:25,2h 30m,non-stop,No info,4107
10679,Air India,27/04/2019,Kolkata,Banglore,CCU BLR,20:45,23:20,2h 35m,non-stop,No info,4145
10680,Jet Airways,27/04/2019,Banglore,Delhi,BLR DEL,08:20,11:20,3h,non-stop,No info,7229
10681,Vistara,01/03/2019,Banglore,New Delhi,BLR DEL,11:30,14:10,2h 40m,non-stop,No info,12648
10682,Air India,9/05/2019,Delhi,Cochin,DEL GOI BOM COK,10:55,19:15,8h 20m,2 stops,No info,11753

# Exporting data

In [105]:
data.to_csv('Advertising.csv')
data.to_csv('https://raw.githubusercontent.com/shebarajitha/Files/main/Advertising.csv')

AttributeError: 'dict' object has no attribute 'to_csv'